// 名单属性
export const listTypeMap = {
  0: "授权名单",
  1: "非授权名单",
};

// 车牌颜色映射
export const plateColorMap = {
  0: "蓝色车牌",
  1: "黄色车牌",
  2: "白色车牌",
  3: "白色",
  4: "黑色车牌",
  5: "民航黑色车牌",
  0xff: "其他",
};

// 车牌类型映射
export const plateTypeMap = {
  0: "标准民用车与军车车牌",
  1: "02式民用车牌",
  2: "武警车车牌",
  3: "警车车牌",
  4: "民用车双行尾牌",
  5: "使馆车牌",
  6: "农用车车牌",
  7: "摩托车车牌",
  8: "新能源车牌",
  9: "领事馆车牌",
  10: "应急车牌",
  0x20: "运输车",
  0x21: "商用车",
  0x22: "私家车",
  0x23: "教练车",
  0x24: "使馆车",
  0x25: "使馆车",
  0x26: "军车",
  0x27: "Protocol 车",
  0x28: "政府车",
  0x29: "出口车",
  0x2a: "出租车",
  0x2b: "测试车",
  0x2c: "转运车",
  0x2d: "货车",
  0x2e: "公交车",
  0x2f: "公共服务车",
  0x30: "公共运输车",
  0x31: "私人运输车",
  0xff: "未知类型",
};

// 通用格式化函数（也可以单独导出）
export function formatByMap(map, key) {
  return map[key] ?? "-";
}
